<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Untitled Page</title>
<meta name="generator" content="WYSIWYG Web Builder 15 Trial Version - http://www.wysiwygwebbuilder.com">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link href="default/jquery.mobile.theme-1.4.5.css" rel="stylesheet">
<link href="default/jquery.mobile.icons-1.4.5.min.css" rel="stylesheet">
<link href="jquery.mobile.structure-1.4.5.min.css" rel="stylesheet">
<link href="иии_mobile.css" rel="stylesheet">
<link href="padvantm.css" rel="stylesheet">
<script src="jquery-1.12.4.min.js"></script>
<script>
$(document).on("mobileinit", function()
{
   $.mobile.ajaxEnabled = false;
});
</script>
<script src="jquery.mobile-1.4.5.min.js"></script>
</head>
<body>
<div data-role="page" data-theme="a" data-title="Untitled Page" id="padvantm">
<div class="ui-content" role="main">
<a href="http://www.wysiwygwebbuilder.com" target="_blank"><img src="images/builtwithwwb15.png" alt="WYSIWYG Web Builder" style="display:inline-block;margin: 0;border-width:0;z-index:250"></a>
<a href="./index.html"><img src="images/Python.svg.png" id="Image1" alt=""></a>
<div id="wb_Text1">
<span style="color:#000000;font-family:Arial;font-size:13px;"><strong>Серед основних переваг Python можна назвати такі:</strong></span>
</div>
<div id="wb_Text2">
<span style="color:#000000;font-family:Arial;font-size:13px;">1.&#1095;&#1080;&#1089;&#1090;&#1080;&#1081; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; (&#1076;&#1083;&#1103; &#1074;&#1080;&#1076;&#1110;&#1083;&#1077;&#1085;&#1085;&#1103; &#1073;&#1083;&#1086;&#1082;&#1110;&#1074; &#1089;&#1083;&#1110;&#1076; &#1074;&#1080;&#1082;&#1086;&#1088;&#1080;&#1089;&#1090;&#1086;&#1074;&#1091;&#1074;&#1072;&#1090;&#1080; &#1074;&#1110;&#1076;&#1089;&#1090;&#1091;&#1087;&#1080;);<br>2.&#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1085;&#1110;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084; (&#1097;&#1086; &#1074;&#1083;&#1072;&#1089;&#1090;&#1080;&#1074;&#1077; &#1073;&#1110;&#1083;&#1100;&#1096;&#1086;&#1089;&#1090;&#1110; &#1110;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1086;&#1074;&#1072;&#1085;&#1080;&#1093; &#1084;&#1086;&#1074;);<br>3.&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1080;&#1081; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074; &#1084;&#1072;&#1108; &#1074;&#1077;&#1083;&#1080;&#1082;&#1091; &#1082;&#1110;&#1083;&#1100;&#1082;&#1110;&#1089;&#1090;&#1100; &#1082;&#1086;&#1088;&#1080;&#1089;&#1085;&#1080;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1110;&#1074; (&#1074;&#1082;&#1083;&#1102;&#1095;&#1085;&#1086; &#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; &#1076;&#1083;&#1103; &#1088;&#1086;&#1079;&#1088;&#1086;&#1073;&#1082;&#1080; &#1075;&#1088;&#1072;&#1092;&#1110;&#1095;&#1085;&#1086;&#1075;&#1086; &#1110;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091;);<br>4.&#1084;&#1086;&#1078;&#1083;&#1080;&#1074;&#1110;&#1089;&#1090;&#1100; &#1074;&#1080;&#1082;&#1086;&#1088;&#1080;&#1089;&#1090;&#1072;&#1085;&#1085;&#1103; Python &#1074; &#1076;&#1110;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084;&#1091; &#1088;&#1077;&#1078;&#1080;&#1084;&#1110; (&#1076;&#1091;&#1078;&#1077; &#1082;&#1086;&#1088;&#1080;&#1089;&#1085;&#1077; &#1076;&#1083;&#1103; &#1077;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103; &#1090;&#1072; &#1088;&#1086;&#1079;&#1074;'&#1103;&#1079;&#1072;&#1085;&#1085;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1093; &#1079;&#1072;&#1076;&#1072;&#1095;);<br>5.&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1080;&#1081; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074; &#1084;&#1072;&#1108; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;, &#1072;&#1083;&#1077; &#1088;&#1072;&#1079;&#1086;&#1084; &#1110;&#1079; &#1090;&#1080;&#1084; &#1076;&#1086;&#1089;&#1080;&#1090;&#1100; &#1087;&#1086;&#1090;&#1091;&#1078;&#1085;&#1077; &#1089;&#1077;&#1088;&#1077;&#1076;&#1086;&#1074;&#1080;&#1097;&#1077; &#1088;&#1086;&#1079;&#1088;&#1086;&#1073;&#1082;&#1080;, &#1103;&#1082;&#1077; &#1079;&#1074;&#1077;&#1090;&#1100;&#1089;&#1103; IDLE &#1110; &#1103;&#1082;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1077; &#1084;&#1086;&#1074;&#1086;&#1102; Python;<br>6.&#1079;&#1088;&#1091;&#1095;&#1085;&#1080;&#1081; &#1076;&#1083;&#1103; &#1088;&#1086;&#1079;&#1074;'&#1103;&#1079;&#1072;&#1085;&#1085;&#1103; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1085;&#1080;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; (&#1084;&#1072;&#1108; &#1079;&#1072;&#1089;&#1086;&#1073;&#1080; &#1088;&#1086;&#1073;&#1086;&#1090;&#1080; &#1079; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1089;&#1085;&#1080;&#1084;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;&#1080;, &#1084;&#1086;&#1078;&#1077; &#1086;&#1087;&#1077;&#1088;&#1091;&#1074;&#1072;&#1090;&#1080; &#1079; &#1094;&#1110;&#1083;&#1080;&#1084;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;&#1080; &#1076;&#1086;&#1074;&#1110;&#1083;&#1100;&#1085;&#1086;&#1111; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1080;, &#1091; &#1076;&#1110;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084;&#1091; &#1088;&#1077;&#1078;&#1080;&#1084;&#1110; &#1084;&#1086;&#1078;&#1077; &#1074;&#1080;&#1082;&#1086;&#1088;&#1080;&#1089;&#1090;&#1086;&#1074;&#1091;&#1074;&#1072;&#1090;&#1080;&#1089;&#1103; &#1103;&#1082; &#1087;&#1086;&#1090;&#1091;&#1078;&#1085;&#1080;&#1081; &#1082;&#1072;&#1083;&#1100;&#1082;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088;);<br>7.&#1074;&#1110;&#1076;&#1082;&#1088;&#1080;&#1090;&#1080;&#1081; &#1082;&#1086;&#1076; (&#1084;&#1086;&#1078;&#1083;&#1080;&#1074;&#1110;&#1089;&#1090;&#1100; &#1088;&#1077;&#1076;&#1072;&#1075;&#1091;&#1074;&#1072;&#1090;&#1080; &#1081;&#1086;&#1075;&#1086; &#1110;&#1085;&#1096;&#1080;&#1084;&#1080; &#1082;&#1086;&#1088;&#1080;&#1089;&#1090;&#1091;&#1074;&#1072;&#1095;&#1072;&#1084;&#1080;).<br><br></span>
</div>
<div id="wb_Text3">
<span style="color:#000000;font-family:Arial;font-size:13px;line-height:16px;">Python має ефективні структури даних високого рівня та простий, але ефективний підхід до об'єктно-орієнтованого програмування. Елегантний синтаксис Python, динамічна обробка типів, а також те, що це інтерпретована мова, роблять її ідеальною для написання скриптів та швидкої розробки прикладних програм у багатьох галузях на більшості платформ.<br>Інтерпретатор мови Python і багата Стандартна бібліотека (як вихідні тексти, так і бінарні дистрибутиви для всіх основних операційних систем) можуть бути отримані з сайту Python www.python.org, і можуть вільно розповсюджуватися. Цей самий сайт має дистрибутиви та посилання на численні модулі, програми, утиліти та додаткову документацію.<br>Інтерпретатор мови Python може бути розширений функціями та типами даних, розробленими на C чи C</span><span style="color:#000000;font-family:'Microsoft YaHei';font-size:13px;line-height:18px;">＋＋</span><span style="color:#000000;font-family:Arial;font-size:13px;line-height:18px;"> (або на іншій мові, яку можна викликати із C). Python також зручна як мова розширення для прикладних програм, що потребують подальшого налагодження.<br></span>
</div>
<input type="submit" id="Button1" onclick="window.location.href='./indexm.html';return false;" name="" value="На головну" title="&#1053;&#1072; &#1075;&#1086;&#1083;&#1086;&#1074;&#1085;&#1091;">
</div>
</div>
</body>
</html>