<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Untitled Page</title>
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link href="default/jquery.mobile.theme-1.4.5.css" rel="stylesheet">
<link href="default/jquery.mobile.icons-1.4.5.min.css" rel="stylesheet">
<link href="jquery.mobile.structure-1.4.5.min.css" rel="stylesheet">
<link href="иии_mobile.css" rel="stylesheet">
<link href="pdevm.css" rel="stylesheet">
<script src="jquery-1.12.4.min.js"></script>
<script>
$(document).on("mobileinit", function()
{
   $.mobile.ajaxEnabled = false;
});
</script>
<script src="jquery.mobile-1.4.5.min.js"></script>
</head>
<body>
<div data-role="page" data-theme="a" data-title="Untitled Page" id="pdevm">
<div class="ui-content" role="main">
<img src="images/150px-Guido_van_Rossum_OSCON_2006.png" id="Image1" alt="">
<div id="wb_Text3">
<span style="color:#000000;font-family:Arial;font-size:24px;"><strong>Гвідо ван Россум</strong></span>
</div>
<div id="wb_Text1">
<span style="color:#000000;font-family:Arial;font-size:16px;">&nbsp;&nbsp;&nbsp; &#1043;&#1074;&#1110;&#0769;&#1076;&#1086; &#1074;&#1072;&#1085; &#1056;&#1086;&#0769;&#1089;&#1089;&#1091;&#1084; (&#1085;&#1110;&#1076;. Guido van Rossum; 31 &#1089;&#1110;&#1095;&#1085;&#1103; 1956, &#1043;&#1072;&#1088;&#1083;&#1077;&#1084;, &#1055;&#1110;&#1074;&#1085;&#1110;&#1095;&#1085;&#1072; &#1043;&#1086;&#1083;&#1083;&#1072;&#1085;&#1076;&#1110;&#1103;, &#1053;&#1110;&#1076;&#1077;&#1088;&#1083;&#1072;&#1085;&#1076;&#1080;) &#8212; &#1085;&#1110;&#1076;&#1077;&#1088;&#1083;&#1072;&#1085;&#1076;&#1089;&#1100;&#1082;&#1080;&#1081; (&#1075;&#1086;&#1083;&#1083;&#1072;&#1085;&#1076;&#1089;&#1100;&#1082;&#1080;&#1081;) &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1110;&#1089;&#1090;, &#1074;&#1110;&#1076;&#1086;&#1084;&#1080;&#1081; &#1079;&#1072;&#1074;&#1076;&#1103;&#1082;&#1080; &#1089;&#1090;&#1074;&#1086;&#1088;&#1077;&#1085;&#1085;&#1102; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086;&#1111; &#1074;&#1080;&#1089;&#1086;&#1082;&#1086;&#1088;&#1110;&#1074;&#1085;&#1077;&#1074;&#1086;&#1111; &#1084;&#1086;&#1074;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103; Python.<br>&nbsp;&nbsp;&nbsp; &#1059; &#1075;&#1088;&#1086;&#1084;&#1072;&#1076;&#1110; &#1084;&#1086;&#1074;&#1080; Python &#1074;&#1072;&#1085; &#1056;&#1086;&#1089;&#1089;&#1091;&#1084; &#1074;&#1110;&#1076;&#1086;&#1084;&#1080;&#1081; &#1103;&#1082; &#0171;&#1076;&#1086;&#1073;&#1088;&#1086;&#1079;&#1080;&#1095;&#1083;&#1080;&#1074;&#1080;&#1081; &#1076;&#1086;&#1074;&#1110;&#1095;&#1085;&#1080;&#1081; &#1076;&#1080;&#1082;&#1090;&#1072;&#1090;&#1086;&#1088;&#0187;, &#1103;&#1082;&#1080;&#1081; &#1087;&#1088;&#1086;&#1076;&#1086;&#1074;&#1078;&#1091;&#1108; &#1089;&#1087;&#1086;&#1089;&#1090;&#1077;&#1088;&#1110;&#1075;&#1072;&#1090;&#1080; &#1079;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1086;&#1084; &#1111;&#1111; &#1088;&#1086;&#1079;&#1088;&#1086;&#1073;&#1082;&#1080; &#1090;&#1072;, &#1079;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1110;&#1076;&#1085;&#1086;&#1089;&#1090;&#1110;, &#1087;&#1088;&#1080;&#1081;&#1084;&#1072;&#1108; &#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1077; &#1088;&#1110;&#1096;&#1077;&#1085;&#1085;&#1103; &#1097;&#1086;&#1076;&#1086; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1091; &#1084;&#1086;&#1074;&#1080;.<br><br></span>
</div>
<div id="wb_Text5">
<span style="color:#000000;font-family:Arial;font-size:16px;line-height:19px;">Народився та виріс у Нідерландах, отримав диплом магістра від Амстердамського університету у 1982 році.<br>Переїхав до США у 1995 році, де зустрів свою дружину. До липня 2003, зі своїм сином (2001), вони жили у Північній Вірджинії у передмісті Вашингтону.<br>У 2005 влаштувався працювати у Google, у зв'язку з чим разом із сім'єю переїхав до Кремнієвої долини. У 2006 Асоціацією обчислювальної техніки був визнаним «Видатним інженером».<br>Улюблена телевізійна програма — «Літаючий Цирк Монті Пайтона», на честь якої названа створена ним мова.<br></span>
</div>
<input type="submit" id="Button1" onclick="window.location.href='./indexm.html';return false;" name="" value="На головну" title="&#1053;&#1072; &#1075;&#1086;&#1083;&#1086;&#1074;&#1085;&#1091;">
</div>
</div>
</body>
</html>