<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Untitled Page</title>
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link href="default/jquery.mobile.theme-1.4.5.css" rel="stylesheet">
<link href="default/jquery.mobile.icons-1.4.5.min.css" rel="stylesheet">
<link href="jquery.mobile.structure-1.4.5.min.css" rel="stylesheet">
<link href="иии_mobile.css" rel="stylesheet">
<link href="pinfom.css" rel="stylesheet">
<script src="jquery-1.12.4.min.js"></script>
<script>
$(document).on("mobileinit", function()
{
   $.mobile.ajaxEnabled = false;
});
</script>
<script src="jquery.mobile-1.4.5.min.js"></script>
</head>
<body>
<div data-role="page" data-theme="a" data-title="Untitled Page" id="pinfom">
<div class="ui-content" role="main">
<img src="images/Python.svg.png" id="Image1" alt="">
<div id="wb_Text1">
<span style="color:#000000;font-family:Arial;font-size:13px;">Python (&#1085;&#1072;&#1081;&#1095;&#1072;&#1089;&#1090;&#1110;&#1096;&#1077; &#1074;&#1078;&#1080;&#1074;&#1072;&#1085;&#1077; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1103; &#8212; &#0171;&#1055;&#1072;&#0769;&#1081;&#1090;&#1086;&#1085;&#0187;, &#1079;&#1072;&#1087;&#1086;&#1079;&#1080;&#1095;&#1077;&#1085;&#1086; &#1085;&#1072;&#1079;&#1074;&#1091; &#1079; &#1073;&#1088;&#1080;&#1090;&#1072;&#1085;&#1089;&#1100;&#1082;&#1086;&#1075;&#1086; &#1096;&#1086;&#1091; &#1052;&#1086;&#1085;&#1090;&#1110; &#1055;&#1072;&#1081;&#1090;&#1086;&#1085;) &#8212; &#1110;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1086;&#1074;&#1072;&#1085;&#1072; &#1086;&#1073;'&#1108;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1110;&#1108;&#1085;&#1090;&#1086;&#1074;&#1072;&#1085;&#1072; &#1084;&#1086;&#1074;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103; &#1074;&#1080;&#1089;&#1086;&#1082;&#1086;&#1075;&#1086; &#1088;&#1110;&#1074;&#1085;&#1103; &#1079;&#1110; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1102; &#1076;&#1080;&#1085;&#1072;&#1084;&#1110;&#1095;&#1085;&#1086;&#1102; &#1090;&#1080;&#1087;&#1110;&#1079;&#1072;&#1094;&#1110;&#1108;&#1102;. &#1056;&#1086;&#1079;&#1088;&#1086;&#1073;&#1083;&#1077;&#1085;&#1072; &#1074; 1990 &#1088;&#1086;&#1094;&#1110; &#1043;&#1074;&#1110;&#1076;&#1086; &#1074;&#1072;&#1085; &#1056;&#1086;&#1089;&#1089;&#1091;&#1084;&#1086;&#1084;. &#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080; &#1076;&#1072;&#1085;&#1080;&#1093; &#1074;&#1080;&#1089;&#1086;&#1082;&#1086;&#1075;&#1086; &#1088;&#1110;&#1074;&#1085;&#1103; &#1088;&#1072;&#1079;&#1086;&#1084; &#1110;&#1079; &#1076;&#1080;&#1085;&#1072;&#1084;&#1110;&#1095;&#1085;&#1086;&#1102; &#1089;&#1077;&#1084;&#1072;&#1085;&#1090;&#1080;&#1082;&#1086;&#1102; &#1090;&#1072; &#1076;&#1080;&#1085;&#1072;&#1084;&#1110;&#1095;&#1085;&#1080;&#1084; &#1079;&#1074;'&#1103;&#1079;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103;&#1084; &#1088;&#1086;&#1073;&#1083;&#1103;&#1090;&#1100; &#1111;&#1111; &#1087;&#1088;&#1080;&#1074;&#1072;&#1073;&#1083;&#1080;&#1074;&#1086;&#1102; &#1076;&#1083;&#1103; &#1096;&#1074;&#1080;&#1076;&#1082;&#1086;&#1111; &#1088;&#1086;&#1079;&#1088;&#1086;&#1073;&#1082;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;, &#1072; &#1090;&#1072;&#1082;&#1086;&#1078; &#1103;&#1082; &#1079;&#1072;&#1089;&#1110;&#1073; &#1087;&#1086;&#1108;&#1076;&#1085;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103; &#1085;&#1072;&#1103;&#1074;&#1085;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1110;&#1074;. Python &#1087;&#1110;&#1076;&#1090;&#1088;&#1080;&#1084;&#1091;&#1108; &#1084;&#1086;&#1076;&#1091;&#1083;&#1110; &#1090;&#1072; &#1087;&#1072;&#1082;&#1077;&#1090;&#1080; &#1084;&#1086;&#1076;&#1091;&#1083;&#1110;&#1074;, &#1097;&#1086; &#1089;&#1087;&#1088;&#1080;&#1103;&#1108; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1110; &#1090;&#1072; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1084;&#1091; &#1074;&#1080;&#1082;&#1086;&#1088;&#1080;&#1089;&#1090;&#1072;&#1085;&#1085;&#1102; &#1082;&#1086;&#1076;&#1091;. &#1030;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088; Python &#1090;&#1072; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1110; &#1073;&#1110;&#1073;&#1083;&#1110;&#1086;&#1090;&#1077;&#1082;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1110; &#1103;&#1082; &#1091; &#1089;&#1082;&#1086;&#1084;&#1087;&#1110;&#1083;&#1100;&#1086;&#1074;&#1072;&#1085;&#1110;&#1081;, &#1090;&#1072;&#1082; &#1110; &#1091; &#1074;&#1080;&#1093;&#1110;&#1076;&#1085;&#1110;&#1081; &#1092;&#1086;&#1088;&#1084;&#1110; &#1085;&#1072; &#1074;&#1089;&#1110;&#1093; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1080;&#1093; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;&#1093;. &#1042; &#1084;&#1086;&#1074;&#1110; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103; Python &#1087;&#1110;&#1076;&#1090;&#1088;&#1080;&#1084;&#1091;&#1108;&#1090;&#1100;&#1089;&#1103; &#1082;&#1110;&#1083;&#1100;&#1082;&#1072; &#1087;&#1072;&#1088;&#1072;&#1076;&#1080;&#1075;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103;, &#1079;&#1086;&#1082;&#1088;&#1077;&#1084;&#1072;: &#1086;&#1073;'&#1108;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1110;&#1108;&#1085;&#1090;&#1086;&#1074;&#1072;&#1085;&#1072;, &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1085;&#1072;, &#1092;&#1091;&#1085;&#1082;&#1094;&#1110;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1072; &#1090;&#1072; &#1072;&#1089;&#1087;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1110;&#1108;&#1085;&#1090;&#1086;&#1074;&#1072;&#1085;&#1072;.<br><br></span>
</div>
<input type="submit" id="Button1" onclick="window.location.href='./indexm.html';return false;" name="" value="На головну" title="&#1053;&#1072; &#1075;&#1086;&#1083;&#1086;&#1074;&#1085;&#1091;">
</div>
</div>
</body>
</html>