<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Python</title>
<link href="font-awesome.min.css" rel="stylesheet">
<link href="иии.css" rel="stylesheet">
<link href="pythontypesstruc.css" rel="stylesheet">
<script src="jquery-1.12.4.min.js"></script>
<script src="wb.overlay.min.js"></script>
<script src="wb.drilldownmenu.min.js"></script>
<script>
$(document).ready(function()
{
   var $overlaymenu = $('#OverlayMenu1-overlay');
   $overlaymenu.overlay({'hideTransition':true});
   $('.OverlayMenu1').drilldownmenu({backText: 'Back'});
   $('#OverlayMenu1').on('click', function(e)
   {
      $.overlay.show($overlaymenu);
      return false;
   });
});
</script>
</head>
<body>
<div id="container">
<div id="wb_Text1" style="position:absolute;left:2065px;top:868px;width:781px;height:119px;z-index:1;">
<span style="color:#000000;font-family:Arial;font-size:13px;">Python (&#1085;&#1072;&#1081;&#1095;&#1072;&#1089;&#1090;&#1110;&#1096;&#1077; &#1074;&#1078;&#1080;&#1074;&#1072;&#1085;&#1077; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1103; &#8212; &#0171;&#1055;&#1072;&#0769;&#1081;&#1090;&#1086;&#1085;&#0187;, &#1079;&#1072;&#1087;&#1086;&#1079;&#1080;&#1095;&#1077;&#1085;&#1086; &#1085;&#1072;&#1079;&#1074;&#1091;[5] &#1079; &#1073;&#1088;&#1080;&#1090;&#1072;&#1085;&#1089;&#1100;&#1082;&#1086;&#1075;&#1086; &#1096;&#1086;&#1091; &#1052;&#1086;&#1085;&#1090;&#1110; &#1055;&#1072;&#1081;&#1090;&#1086;&#1085;) &#8212; &#1110;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1086;&#1074;&#1072;&#1085;&#1072; &#1086;&#1073;'&#1108;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1110;&#1108;&#1085;&#1090;&#1086;&#1074;&#1072;&#1085;&#1072; &#1084;&#1086;&#1074;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103; &#1074;&#1080;&#1089;&#1086;&#1082;&#1086;&#1075;&#1086; &#1088;&#1110;&#1074;&#1085;&#1103; &#1079;&#1110; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1102; &#1076;&#1080;&#1085;&#1072;&#1084;&#1110;&#1095;&#1085;&#1086;&#1102; &#1090;&#1080;&#1087;&#1110;&#1079;&#1072;&#1094;&#1110;&#1108;&#1102;.[6] &#1056;&#1086;&#1079;&#1088;&#1086;&#1073;&#1083;&#1077;&#1085;&#1072; &#1074; 1990 &#1088;&#1086;&#1094;&#1110; &#1043;&#1074;&#1110;&#1076;&#1086; &#1074;&#1072;&#1085; &#1056;&#1086;&#1089;&#1089;&#1091;&#1084;&#1086;&#1084;. &#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080; &#1076;&#1072;&#1085;&#1080;&#1093; &#1074;&#1080;&#1089;&#1086;&#1082;&#1086;&#1075;&#1086; &#1088;&#1110;&#1074;&#1085;&#1103; &#1088;&#1072;&#1079;&#1086;&#1084; &#1110;&#1079; &#1076;&#1080;&#1085;&#1072;&#1084;&#1110;&#1095;&#1085;&#1086;&#1102; &#1089;&#1077;&#1084;&#1072;&#1085;&#1090;&#1080;&#1082;&#1086;&#1102; &#1090;&#1072; &#1076;&#1080;&#1085;&#1072;&#1084;&#1110;&#1095;&#1085;&#1080;&#1084; &#1079;&#1074;'&#1103;&#1079;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103;&#1084; &#1088;&#1086;&#1073;&#1083;&#1103;&#1090;&#1100; &#1111;&#1111; &#1087;&#1088;&#1080;&#1074;&#1072;&#1073;&#1083;&#1080;&#1074;&#1086;&#1102; &#1076;&#1083;&#1103; &#1096;&#1074;&#1080;&#1076;&#1082;&#1086;&#1111; &#1088;&#1086;&#1079;&#1088;&#1086;&#1073;&#1082;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;, &#1072; &#1090;&#1072;&#1082;&#1086;&#1078; &#1103;&#1082; &#1079;&#1072;&#1089;&#1110;&#1073; &#1087;&#1086;&#1108;&#1076;&#1085;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103; &#1085;&#1072;&#1103;&#1074;&#1085;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1110;&#1074;. Python &#1087;&#1110;&#1076;&#1090;&#1088;&#1080;&#1084;&#1091;&#1108; &#1084;&#1086;&#1076;&#1091;&#1083;&#1110; &#1090;&#1072; &#1087;&#1072;&#1082;&#1077;&#1090;&#1080; &#1084;&#1086;&#1076;&#1091;&#1083;&#1110;&#1074;, &#1097;&#1086; &#1089;&#1087;&#1088;&#1080;&#1103;&#1108; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1110; &#1090;&#1072; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1084;&#1091; &#1074;&#1080;&#1082;&#1086;&#1088;&#1080;&#1089;&#1090;&#1072;&#1085;&#1085;&#1102; &#1082;&#1086;&#1076;&#1091;. &#1030;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088; Python &#1090;&#1072; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1110; &#1073;&#1110;&#1073;&#1083;&#1110;&#1086;&#1090;&#1077;&#1082;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1110; &#1103;&#1082; &#1091; &#1089;&#1082;&#1086;&#1084;&#1087;&#1110;&#1083;&#1100;&#1086;&#1074;&#1072;&#1085;&#1110;&#1081;, &#1090;&#1072;&#1082; &#1110; &#1091; &#1074;&#1080;&#1093;&#1110;&#1076;&#1085;&#1110;&#1081; &#1092;&#1086;&#1088;&#1084;&#1110; &#1085;&#1072; &#1074;&#1089;&#1110;&#1093; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1080;&#1093; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;&#1093;. &#1042; &#1084;&#1086;&#1074;&#1110; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103; Python &#1087;&#1110;&#1076;&#1090;&#1088;&#1080;&#1084;&#1091;&#1108;&#1090;&#1100;&#1089;&#1103; &#1082;&#1110;&#1083;&#1100;&#1082;&#1072; &#1087;&#1072;&#1088;&#1072;&#1076;&#1080;&#1075;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1091;&#1074;&#1072;&#1085;&#1085;&#1103;, &#1079;&#1086;&#1082;&#1088;&#1077;&#1084;&#1072;: &#1086;&#1073;'&#1108;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1110;&#1108;&#1085;&#1090;&#1086;&#1074;&#1072;&#1085;&#1072;, &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1085;&#1072;, &#1092;&#1091;&#1085;&#1082;&#1094;&#1110;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1072; &#1090;&#1072; &#1072;&#1089;&#1087;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1110;&#1108;&#1085;&#1090;&#1086;&#1074;&#1072;&#1085;&#1072;.</span></div>
<div id="wb_Text2" style="position:absolute;left:30px;top:81px;width:527px;height:271px;text-align:justify;z-index:2;">
<span style="color:#000000;font-family:Arial;font-size:19px;"><strong>Python підтримує динамічну типізацію, тобто, тип змінної визначається лише під час виконання. З базових типів слід зазначити підтримку цілих чисел довільної довжини і комплексних чисел. Python має багату бібліотеку для роботи з рядками, зокрема, кодованими в юнікоді. З колекцій Python підтримує кортежі (tuples), списки (масиви), словники (асоціативні масиви) і від версії 2.4, множини. Система класів підтримує множинне успадкування і метапрограмування. Будь-який тип, включаючи базові, входить до системи класів, й за необхідності можливе успадкування навіть від базових типів. <br></strong></span></div>
<div id="wb_Image1" style="position:absolute;left:591px;top:108px;width:194px;height:197px;z-index:3;">
<a href="./index.html"><img src="images/Python.svg.png" id="Image1" alt=""></a></div>
<div id="wb_Text3" style="position:absolute;left:30px;top:28px;width:468px;height:30px;z-index:4;">
<span style="color:#000000;font-family:Arial;font-size:27px;"><strong>Типи та структури</strong></span></div>
<hr id="Line1" style="position:absolute;left:30px;top:66px;width:726px;z-index:5;">
<div id="wb_OverlayMenu1" style="position:absolute;left:662px;top:1px;width:55px;height:49px;z-index:6;">
<a href="#" id="OverlayMenu1">
<span class="line"></span>
<span class="line">
</span><span class="line"></span>
</a>
</div>
</div>
<div id="OverlayMenu1-overlay">
<div class="OverlayMenu1">
<ul class="drilldown-menu" role="menu">
<li>
<a role="menuitem" href="#"><i class="fa fa-book overlay-icon"></i>&#1055;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080;&nbsp;&#1085;&#1072;...</a>
<ul class="drilldown-submenu" role="menu">
<li><a role="menuitem" href="./pythoninfo.html"><i class="fa fa-fire overlay-icon"></i>&#1030;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1110;&#1103;</a></li>
<li><a role="menuitem" href="./pythonadvant.html"><i class="fa fa-check-square overlay-icon"></i>&#1055;&#1077;&#1088;&#1077;&#1074;&#1072;&#1075;&#1080;&nbsp;Python</a></li>
<li><a role="menuitem" href="./pythontypesstruc.html"><i class="fa fa-css3 overlay-icon"></i>&#1058;&#1080;&#1087;&#1080;&nbsp;&#1090;&#1072;&nbsp;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080;</a></li>
<li><a role="menuitem" href="./pythondev.html"><i class="fa fa-code overlay-icon"></i>&#1056;&#1086;&#1079;&#1088;&#1086;&#1073;&#1085;&#1080;&#1082;&nbsp;Python</a></li>
</ul>
</li>
<li><a role="menuitem" href="./index.html"><i class="fa fa-home overlay-icon"></i>&#1053;&#1072;&nbsp;&#1075;&#1086;&#1083;&#1086;&#1074;&#1085;&#1091;</a></li>
   </ul>
</div>
<a class="close-button" id="OverlayMenu1-close" href="#" role="button" aria-hidden="true"><span></span></a>
</div>
</body>
</html>